### Goal
Summarise every exercise of SQL Bolt website and reproduce them in Python

### SQL Lesson 1: SELECT queries 101

- Find the title of each film
```mysql
SELECT Title FROM movies;
```
- Find the director of each film
```mysql
SELECT Director FROM movies;
```
- Find the title and director of each film
```mysql
SELECT Title, Director FROM movies;
```
- Find the title and year of each film
```mysql
SELECT Title, Year FROM movies;
```
- Find all the information about each film
```mysql
SELECT * FROM movies;
```

### SQL Lesson 2: Queries with constraints (Pt. 1)

- Find the movie with a row id of 6
```mysql
SELECT * FROM movies
WHERE Id = 6;
```
- Find the movies released in the years between 2000 and 2010
```mysql
SELECT * FROM movies
WHERE year BETWEEN 2000 AND 2010;
```
- Find the movies not released in the years between 2000 and 2010
```mysql
SELECT * FROM movies
WHERE year NOT BETWEEN 2000 AND 2010;
```
- Find the first 5 Pixar movies and their release year
```mysql
SELECT * FROM movies
ORDER BY Year
LIMIT 5;
```

### SQL Lesson 3: Queries with constraints (Pt. 2)
- Find all the Toy Story movies
```mysql
SELECT * FROM movies
WHERE Title LIKE "Toy Story%";
```
- Find all the movies directed by John Lasseter
```mysql
SELECT * FROM movies
WHERE Director = "John Lasseter";
```
- Find all the movies (and director) not directed by John Lasseter
```mysql
SELECT * FROM movies
WHERE Director != "John Lasseter";
```
- Find all the WALL-* movies
```mysql
SELECT * FROM movies
WHERE Title LIKE "WALL-%";
```

### SQL Lesson 4: Filtering and sorting Query results
- List all directors of Pixar movies (alphabetically), without duplicates
```mysql
SELECT DISTINCT Director FROM movies
ORDER BY Director;
```
- List the last four Pixar movies released (ordered from most recent to least)
```mysql
SELECT Title FROM movies
ORDER BY Year DESC
LIMIT 4;
```
- List the first five Pixar movies sorted alphabetically
```mysql
SELECT Title FROM movies
ORDER BY Title ASC
LIMIT 5;
```
- List the next five Pixar movies sorted alphabetically
```mysql
SELECT Title FROM movies
ORDER BY Title ASC
LIMIT 5
OFFSET 5;
```

### SQL Review: Simple SELECT Queries
- List all the Canadian cities and their populations
```mysql
SELECT City, Population FROM north_american_cities
WHERE Country = "Canada";
```
- Order all the cities in the United States by their latitude from north to south
```mysql
SELECT * FROM north_american_cities
WHERE Country = "United States"
ORDER BY Latitude DESC;
```
- List all the cities west of Chicago, ordered from west to east
```mysql
SELECT city, longitude FROM north_american_cities
WHERE
Longitude < (
    SELECT Longitude FROM north_american_cities
    WHERE City = "Chicago")
ORDER BY Longitude ASC;
```
- List the two largest cities in Mexico (by population)
```mysql
SELECT City, Population FROM north_american_cities
WHERE
Country = "Mexico" 
ORDER BY Population DESC
LIMIT 2;
```
- List the third and fourth largest cities (by population) in the United States and their population
```mysql
SELECT City, Population FROM north_american_cities
WHERE
Country = "United States" 
ORDER BY Population DESC
LIMIT 2
OFFSET 2;
```

### SQL Lesson 6: Multi-table queries with JOINs
- Find the domestic and international sales for each movie
```mysql
SELECT * FROM movies
JOIN boxoffice
    ON Id = Movie_Id;
```
- Show the sales numbers for each movie that did better internationally rather than domestically
```mysql
SELECT * FROM movies
JOIN boxoffice
    ON Id = Movie_Id
WHERE International_sales > Domestic_sales;
```
- List all the movies by their ratings in descending order
```mysql
SELECT * FROM movies
JOIN boxoffice
    ON Id = Movie_Id
ORDER BY Rating DESC;
```

### SQL Lesson 7: OUTER JOINs
- Find the list of all buildings that have employees
```mysql
SELECT Building FROM employees
GROUP BY Building;
```
- Find the list of all buildings and their capacity
```mysql
SELECT * FROM Buildings;
```
- List all buildings and the distinct employee roles in each building (including empty buildings)
```mysql
SELECT Building_name, Role FROM Buildings
LEFT JOIN Employees
    ON Building_name = Building
GROUP BY 1,2;
```
--- ALTERNATIVE
```mysql
SELECT DISTINCT building_name, role 
FROM buildings 
  LEFT JOIN employees
    ON building_name = building;
```

### SQL Lesson 8: A short note on NULLs
- Find the name and role of all employees who have not been assigned to a building
```mysql
SELECT * FROM employees
WHERE Building IS NULL;
```
- Find the names of the buildings that hold no employees
```mysql
SELECT DISTINCT Building_name FROM Buildings
LEFT JOIN Employees
    ON Building_name = Building
WHERE Role IS NULL;
```

### SQL Lesson 9: Queries with expressions
- List all movies and their combined sales in millions of dollars
```mysql
SELECT 
    Title,
    (Domestic_sales + International_sales)/1000000 AS "sales (Mio)"
FROM movies
JOIN Boxoffice
    ON Id = Movie_Id;
````
- List all movies and their ratings in percent
```mysql
SELECT 
    title, 
    Rating*10 AS Ratings  
FROM movies
  JOIN boxoffice
    ON movies.id = boxoffice.movie_id;
```
- List all movies that were released on even number years
```mysql
SELECT title, year  
FROM movies
WHERE Year%2 = 0;
```

### SQL Lesson 10: Queries with aggregates (Pt. 1)
- Find the longest time that an employee has been at the studio
```mysql
SELECT MAX(Years_employed) FROM employees;
```
- For each role, find the average number of years employed by employees in that role
```mysql
SELECT 
    Role,
    AVG(Years_employed) AS Avg_years
FROM employees
GROUP BY Role;
```
- Find the total number of employee years worked in each building
```mysql
SELECT 
    Building,
    SUM(Years_employed) AS Total_years
FROM employees
GROUP BY Building;
```

### SQL Lesson 11: Queries with aggregates (Pt. 2)
- Find the number of Artists in the studio (without a HAVING clause)
```mysql
SELECT count(role) 
FROM employees
WHERE Role = "Artist";
```
- Find the number of Employees of each role in the studio
```mysql
SELECT Role, count(role) 
FROM employees
GROUP BY Role;
```
- Find the total number of years employed by all Engineers
```mysql
SELECT Role, SUM(Years_employed)
FROM employees
WHERE Role = "Engineer"
```

### SQL Lesson 12: Order of execution of a Query
- Find the number of movies each director has directed
```mysql
SELECT Director, count(Title)
FROM movies
GROUP BY Director
ORDER BY 2 DESC;
```
- Find the total domestic and international sales that can be attributed to each director
```mysql
SELECT Director, SUM(Domestic_sales + International_sales)
FROM movies
JOIN Boxoffice
    ON Id = Movie_Id
GROUP BY Director
ORDER BY 2 DESC;
```

### SQL Lesson 13: Inserting rows
- Add the studio's new production, Toy Story 4 to the list of movies (you can use any director)
```mysql
INSERT INTO Movies
VALUES (20, "Toy Story 4", "Josh Cooley", 2019, 100)
```
- Toy Story 4 has been released to critical acclaim! It had a rating of 8.7, and made 340 million domestically and 270 million internationally. Add the record to the BoxOffice table.
```mysql
INSERT INTO Boxoffice
VALUES (20, 8.7, 340000000, 270000000)
```

### SQL Lesson 14: Updating rows
- The director for A Bug's Life is incorrect, it was actually directed by John Lasseter
```mysql
UPDATE Movies
SET Director = "John Lasseter"
WHERE Id = 2
```
- The year that Toy Story 2 was released is incorrect, it was actually released in 1999
```mysql
UPDATE Movies
SET Year = 1999
WHERE Id = 3
```
- Both the title and director for Toy Story 8 is incorrect! The title should be "Toy Story 3" and it was directed by Lee Unkrich
```mysql
UPDATE Movies
SET
    Title = "Toy Story 3",
    Director = "Lee Unkrich"
WHERE Id = 11
```

### SQL Lesson 15: Deleting rows
- This database is getting too big, lets remove all movies that were released before 2005.
```mysql
DELETE FROM Movies
WHERE Year < 2005;
```
- Andrew Stanton has also left the studio, so please remove all movies directed by him.
```mysql
DELETE FROM Movies
WHERE Director = "Andrew Stanton"
```

### SQL Lesson 16: Creating tables
Create a new table named Database with the following columns:
– Name A string (text) describing the name of the database
– Version A number (floating point) of the latest version of this database
– Download_count An integer count of the number of times this database was downloaded
This table has no constraints.
```mysql
CREATE TABLE Database (
    Name TEXT,
    Version FLOAT,
    Download_count INTEGER
);
```

### SQL Lesson 17: Altering tables
- Add a column named Aspect_ratio with a FLOAT data type to store the aspect-ratio each movie was released in.
```mysql
ALTER TABLE Movies
ADD Aspect_ratio FLOAT
```
- Add another column named Language with a TEXT data type to store the language that the movie was released in. Ensure that the default for this language is English.
```mysql
ALTER TABLE Movies
ADD Language TEXT
    DEFAULT "English"
```

### SQL Lesson 18: Dropping tables
- We've sadly reached the end of our lessons, lets clean up by removing the Movies table
```mysql
DROP TABLE IF EXISTS Movies;
```
- And drop the BoxOffice table as well
```mysql
DROP TABLE IF EXISTS Boxoffice;
```